# texts.py

texts = {
    "start": {
        "ru": "👋 Приветствуем в Tapme Card!\nСледуйте инструкции бота и создайте свою стильную визитку всего за 2 минуты.\n\nДля создания визитки выполните 3 простых шага:\n1. Укажите своё имя и фото;\n2. Добавьте контакты для связи;\n3. Расскажите о бизнесе и прикрепите ссылку на сайт или презентацию.\n\n🔗 Пример: fcard.me/alex",
        "uk": "👋 Вітаємо в Tapme Card!\nДотримуйтесь інструкцій бота, щоб створити свою стильну візитку всього за 2 хвилини.\n\nДля створення візитки виконайте 3 простих кроки:\n1. Вкажіть своє ім’я та фото;\n2. Додайте контактні дані;\n3. Розкажіть про бізнес і додайте посилання на сайт або презентацію.\n\n🔗 Приклад: fcard.me/alex",
        "en": "👋 Welcome to Tapme Card!\nFollow the bot's instructions and create your stylish business card in just 2 minutes.\n\nTo create your card, follow these 3 simple steps:\n1. Enter your name and photo;\n2. Add contact details;\n3. Tell us about your business and attach a link to your website or presentation.\n\n🔗 Example: fcard.me/alex"
    },
    "choose_language": {
        "ru": "🌐 Выберите язык визитки:",
        "uk": "🌐 Оберіть мову візитки:",
        "en": "🌐 Choose your card language:"
    },
    "language_chosen": {
        "ru": "Вы выбрали Русский язык.",
        "uk": "Ви обрали Українську мову.",
        "en": "You selected English language."
    },
    "invalid_language": {
        "ru": "Пожалуйста, выберите язык, нажав на одну из кнопок.",
        "uk": "Будь ласка, виберіть мову, натиснувши одну з кнопок.",
        "en": "Please select a language by clicking one of the buttons."
    },
    "next_step": {
        "ru": "🚀 Продолжаем создание визитки...",
        "uk": "🚀 Продовжуємо створення візитки...",
        "en": "🚀 Let's continue creating your card..."
    },
}
